ïmproved doc and added stats apis
